<?php
// +----------------------------------------------------------------------
// | 海豚PHP框架 [ DolphinPHP ]
// +----------------------------------------------------------------------
// | 版权所有 2016~2019 广东卓锐软件有限公司 [ http://www.zrthink.com ]
// +----------------------------------------------------------------------
// | 官方网站: http://dolphinphp.com
// +----------------------------------------------------------------------

/**
 * 模块信息
 */
return [
  'name' => 'poetry',
  'title' => '诗词',
  'identifier' => 'poetry.zhang.module',
  'author' => 'ZhangEnLai',
  'version' => '1.0.0',
  'description' => '诗词模块',
  'database_prefix' => 'dp_',
];
