<?php
// +----------------------------------------------------------------------
// | 海豚PHP框架 [ DolphinPHP ]
// +----------------------------------------------------------------------
// | 版权所有 2016~2019 广东卓锐软件有限公司 [ http://www.zrthink.com ]
// +----------------------------------------------------------------------
// | 官方网站: http://dolphinphp.com
// +----------------------------------------------------------------------

/**
 * 模块信息
 */
return [
  'name' => 'course',
  'title' => '课程',
  'identifier' => 'course.zhang.module',
  'author' => 'ZhangEnLai',
  'version' => '1.0.0',
  'description' => '课程模块',
  'config' => [
    [
      'textarea',
      'category',
      '课程分类',
      '',
      '1:公开课
2:连锁企业采购与配送管理
3:毛泽东思想和中国特色社会主义
4:思想道德修养与法律基础
5:卖场营销策划
6:连锁企业人力资源管理',
    ],
    [
      'textarea',
      'type',
      '资源类型',
      '',
      '1:视频
2:音频
3:课件
4:其他',
    ],
  ],
  'action' => [
    [
      'module' => 'course',
      'name' => 'slider_delete',
      'title' => '删除滚动图片',
      'remark' => '删除滚动图片',
      'rule' => '',
      'log' => '[user|get_nickname] 删除了滚动图片：[details]',
      'status' => 1,
    ],
  ],
  'database_prefix' => 'dp_',
];
